system/blockMeshDict

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001 ;

vertices
(
 (10 -10 0)
 (10 10 0)
 (-10 10 0)
 (-10 -10 0)
 (10 -10 8)
 (10 10 8)
 (-10 10 8)
 (-10 -10 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 120 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (0 3 7 4)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (2 6 7 3)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
