system/setFieldsDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    sphereToCell
    {
        centre (0 0 0.001639 );   //remember this are in meters
            radius 0.001639 ;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
	    volVectorFieldValue U ( 0 0 -0.626)	
        );
    }
    
);


// ************************************************************************* //
